turbinesFoam/validation/nacelle-asn/case/0.org/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Website:  www.openfoam.com                      |
|   \\  /    A nd           |                                                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nut;
}
// Generated from config/case.yaml. Do not edit by hand.

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type cyclic;
    }

    outlet
    {
        type cyclic;
    }

    bottom
    {
        type symmetry;
    }
    top
    {
        type symmetry;
    }
    sideMinus
    {
        type symmetry;
    }
    sidePlus
    {
        type symmetry;
    }
}
