turbinesFoam/validation/nacelle-asn/case/constant/turbulenceProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Website:  www.openfoam.com                      |
|   \\  /    A nd           |                                                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      turbulenceProperties;
}
// Generated from config/case.yaml. Do not edit by hand.

simulationType LES;

LES
{
    LESModel WALE;
    turbulence on;
    printCoeffs on;
    delta cubeRootVol;
}
