turbinesFoam/validation/nacelle-asn/case/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Website:  www.openfoam.com                      |
|   \\  /    A nd           |                                                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// Generated from config/case.yaml. Do not edit by hand.

scale 1;

vertices
(
    (-10 -10 -10)
    (20 -10 -10)
    (20 10 -10)
    (-10 10 -10)
    (-10 -10 10)
    (20 -10 10)
    (20 10 10)
    (-10 10 10)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (153 80 80) simpleGrading (1 1 1)
);

edges ();

boundary
(
    inlet
    {
        type cyclic;
        neighbourPatch outlet;
        faces
        (
            (0 4 7 3)
        );
    }
    outlet
    {
        type cyclic;
        neighbourPatch inlet;
        faces
        (
            (1 2 6 5)
        );
    }
    bottom
    {
        type symmetry;
        faces
        (
            (0 3 2 1)
        );
    }
    top
    {
        type symmetry;
        faces
        (
            (4 5 6 7)
        );
    }
    sideMinus
    {
        type symmetry;
        faces
        (
            (0 1 5 4)
        );
    }
    sidePlus
    {
        type symmetry;
        faces
        (
            (3 7 6 2)
        );
    }
);

mergePatchPairs ();
