turbinesFoam/validation/nacelle-asn/case/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Website:  www.openfoam.com                      |
|   \\  /    A nd           |                                                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}
// Generated from config/case.yaml. Do not edit by hand.

actions
(
    {
        name nacelleCells;
        type cellSet;
        action new;
        source boxToCell;
        box (-8 -2 -2) (1 2 2);
    }
);
